geosmall/Arduino_Core_STM32/boards.txt
Nucleo_64.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
Nucleo_64.menu.upload_method.jlinkMethod.upload.protocol=3
Nucleo_64.menu.upload_method.jlinkMethod.upload.options=
Nucleo_64.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

Nucleo_64.menu.upload_method.clipboard=Clipboard (Copy Path)
Nucleo_64.menu.upload_method.clipboard.upload.protocol=0
Nucleo_64.menu.upload_method.clipboard.upload.options=-g
Nucleo_64.menu.upload_method.clipboard.upload.tool=clipboard_upload

################################################################################
# Nucleo 32 boards

Nucleo_32.name=Nucleo-32
Nucleo_32.build.core=arduino
Nucleo_32.build.board=Nucleo_32
Nucleo_32.build.variant_h=variant_{build.board}.h
Nucleo_32.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Nucleo_32.build.flash_offset=0x0
Nucleo_32.upload.maximum_size=0
Nucleo_32.upload.maximum_data_size=0

# Upload menu
Nucleo_32.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Nucleo_32.menu.upload_method.swdMethod.upload.protocol=0
Nucleo_32.menu.upload_method.swdMethod.upload.options=
Nucleo_32.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Nucleo_32.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Nucleo_32.menu.upload_method.serialMethod.upload.protocol=1
Nucleo_32.menu.upload_method.serialMethod.upload.options={serial.port.file}
Nucleo_32.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Nucleo_32.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Nucleo_32.menu.upload_method.dfuMethod.upload.protocol=2
Nucleo_32.menu.upload_method.dfuMethod.upload.options=
Nucleo_32.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Nucleo_32.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
Nucleo_32.menu.upload_method.jlinkMethod.upload.protocol=3
Nucleo_32.menu.upload_method.jlinkMethod.upload.options=
Nucleo_32.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

Nucleo_32.menu.upload_method.clipboard=Clipboard (Copy Path)
Nucleo_32.menu.upload_method.clipboard.upload.protocol=0
Nucleo_32.menu.upload_method.clipboard.upload.options=-g
Nucleo_32.menu.upload_method.clipboard.upload.tool=clipboard_upload

# Nucleo G431KB board
Nucleo_32.menu.pnum.NUCLEO_G431KB=Nucleo G431KB
Nucleo_32.menu.pnum.NUCLEO_G431KB.node="NODE_G431KB,NOD_G431KB"
Nucleo_32.menu.pnum.NUCLEO_G431KB.upload.maximum_size=131072
Nucleo_32.menu.pnum.NUCLEO_G431KB.upload.maximum_data_size=32768
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.mcu=cortex-m4
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.board=NUCLEO_G431KB
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.series=STM32G4xx
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.product_line=STM32G431xx
Nucleo_32.menu.pnum.NUCLEO_G431KB.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

################################################################################
# Generic STM32F4 series

GenF4.name=Generic STM32F4 series

GenF4.build.core=arduino
GenF4.build.board=GenF4
GenF4.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF4.build.mcu=cortex-m4
GenF4.build.fpu=-mfpu=fpv4-sp-d16
GenF4.build.float-abi=-mfloat-abi=hard
GenF4.build.series=STM32F4xx
GenF4.build.flash_offset=0x0
GenF4.upload.maximum_size=0
GenF4.upload.maximum_data_size=0

# Upload menu
GenF4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF4.menu.upload_method.swdMethod.upload.protocol=0
GenF4.menu.upload_method.swdMethod.upload.options=
GenF4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF4.menu.upload_method.serialMethod.upload.protocol=1
GenF4.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenF4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF4.menu.upload_method.dfuMethod.upload.protocol=2
GenF4.menu.upload_method.dfuMethod.upload.options=
GenF4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenF4.menu.upload_method.jlinkMethod.upload.protocol=3
GenF4.menu.upload_method.jlinkMethod.upload.options=
GenF4.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID

GenF4.menu.upload_method.clipboard=Clipboard (Copy Path)
GenF4.menu.upload_method.clipboard.upload.protocol=0
GenF4.menu.upload_method.clipboard.upload.options=-g
GenF4.menu.upload_method.clipboard.upload.tool=clipboard_upload

# BlackPill F411CE
GenF4.menu.pnum.BLACKPILL_F411CE=BlackPill F411CE
GenF4.menu.pnum.BLACKPILL_F411CE.upload.maximum_size=524288
GenF4.menu.pnum.BLACKPILL_F411CE.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACKPILL_F411CE.build.board=BLACKPILL_F411CE
GenF4.menu.pnum.BLACKPILL_F411CE.build.product_line=STM32F411xE
GenF4.menu.pnum.BLACKPILL_F411CE.build.variant=STM32F4xx/F411C(C-E)(U-Y)
GenF4.menu.pnum.BLACKPILL_F411CE.build.variant_h=variant_{build.board}.h
GenF4.menu.pnum.BLACKPILL_F411CE.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

################################################################################
# Generic STM32F7 series

GenF7.name=Generic STM32F7 series

GenF7.build.core=arduino
GenF7.build.board=GenF7
GenF7.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF7.build.mcu=cortex-m7
GenF7.build.fpu=-mfpu=fpv4-sp-d16
GenF7.build.float-abi=-mfloat-abi=hard
GenF7.build.series=STM32F7xx
GenF7.build.flash_offset=0x0
GenF7.upload.maximum_size=0
GenF7.upload.maximum_data_size=0

# Upload menu
GenF7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF7.menu.upload_method.swdMethod.upload.protocol=0
GenF7.menu.upload_method.swdMethod.upload.options=
GenF7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

