geosmall/Arduino_Core_STM32/boards.txt
GenF7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF7.menu.upload_method.serialMethod.upload.protocol=1
GenF7.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenF7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF7.menu.upload_method.dfuMethod.upload.protocol=2
GenF7.menu.upload_method.dfuMethod.upload.options=
GenF7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF7.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenF7.menu.upload_method.jlinkMethod.upload.protocol=3
GenF7.menu.upload_method.jlinkMethod.upload.options=
GenF7.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenF7.menu.upload_method.clipboard=Clipboard (Copy Path)
GenF7.menu.upload_method.clipboard.upload.protocol=0
GenF7.menu.upload_method.clipboard.upload.options=-g
GenF7.menu.upload_method.clipboard.upload.tool=clipboard_upload

################################################################################
# Generic STM32G4 series

GenG4.name=Generic STM32G4 series

GenG4.build.core=arduino
GenG4.build.board=GenG4
GenG4.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenG4.build.mcu=cortex-m4
GenG4.build.fpu=-mfpu=fpv4-sp-d16
GenG4.build.float-abi=-mfloat-abi=hard
GenG4.build.series=STM32G4xx
GenG4.build.flash_offset=0x0
GenG4.build.uf2_flash_offset=0x0
GenG4.upload.maximum_size=0
GenG4.upload.maximum_data_size=0

# Upload menu
GenG4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenG4.menu.upload_method.swdMethod.upload.protocol=0
GenG4.menu.upload_method.swdMethod.upload.options=
GenG4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenG4.menu.upload_method.serialMethod.upload.protocol=1
GenG4.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenG4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenG4.menu.upload_method.dfuMethod.upload.protocol=2
GenG4.menu.upload_method.dfuMethod.upload.options=
GenG4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenG4.menu.upload_method.jlinkMethod.upload.protocol=3
GenG4.menu.upload_method.jlinkMethod.upload.options=
GenG4.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.bootuf2Method=UF2 Bootloader
GenG4.menu.upload_method.bootuf2Method.upload.protocol=uf2
GenG4.menu.upload_method.bootuf2Method.upload.tool=uf2_upload
GenG4.menu.upload_method.bootuf2Method.build.flash_offset={build.uf2_flash_offset}
GenG4.menu.upload_method.bootuf2Method.build.bootloader_flags=-DBL_BOOTUF2

GenG4.menu.upload_method.clipboard=Clipboard (Copy Path)
GenG4.menu.upload_method.clipboard.upload.protocol=0
GenG4.menu.upload_method.clipboard.upload.options=-g
GenG4.menu.upload_method.clipboard.upload.tool=clipboard_upload

# WeAct G474 HIL-007 test rig
GenG4.menu.pnum.WEACT_G474_HIL007=WeAct G474 HIL-007
GenG4.menu.pnum.WEACT_G474_HIL007.upload.maximum_size=458752
GenG4.menu.pnum.WEACT_G474_HIL007.upload.maximum_data_size=131072
GenG4.menu.pnum.WEACT_G474_HIL007.build.board=WEACT_G474_HIL007
GenG4.menu.pnum.WEACT_G474_HIL007.build.product_line=STM32G474xx
GenG4.menu.pnum.WEACT_G474_HIL007.build.variant=STM32G4xx/G473C(B-C-E)U_G474C(B-C-E)U_G483CEU_G484CEU
GenG4.menu.pnum.WEACT_G474_HIL007.build.variant_h=variant_WEACT_G474_HIL007.h
GenG4.menu.pnum.WEACT_G474_HIL007.build.uf2_family=0x4c71240a
GenG4.menu.pnum.WEACT_G474_HIL007.build.uf2_flash_offset=0x10000

################################################################################
# Generic STM32H7 Series

GenH7.name=Generic STM32H7 Series

GenH7.build.core=arduino
GenH7.build.board=GenH7
GenH7.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial}
GenH7.build.fpu=-mfpu=fpv4-sp-d16
GenH7.build.float-abi=-mfloat-abi=hard
GenH7.build.series=STM32H7xx
GenH7.build.mcu=cortex-m7
GenH7.build.flash_offset=0x0
GenH7.upload.maximum_size=0
GenH7.upload.maximum_data_size=0

# Upload menu
GenH7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenH7.menu.upload_method.swdMethod.upload.protocol=0
GenH7.menu.upload_method.swdMethod.upload.options=
GenH7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenH7.menu.upload_method.serialMethod.upload.protocol=1
GenH7.menu.upload_method.serialMethod.upload.options={serial.port.file}
GenH7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenH7.menu.upload_method.dfuMethod.upload.protocol=2
GenH7.menu.upload_method.dfuMethod.upload.options=
GenH7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
GenH7.menu.upload_method.jlinkMethod.upload.protocol=3
GenH7.menu.upload_method.jlinkMethod.upload.options=
GenH7.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.clipboard=Clipboard (Copy Path)
GenH7.menu.upload_method.clipboard.upload.protocol=0
GenH7.menu.upload_method.clipboard.upload.options=-g
GenH7.menu.upload_method.clipboard.upload.tool=clipboard_upload

################################################################################
# Flight Controller Boards

FlightCtr.name=Flight Controller Boards

FlightCtr.build.core=arduino
FlightCtr.build.board=Genericflight
FlightCtr.build.variant_h=variant_{build.board}.h
FlightCtr.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
FlightCtr.build.fpu=-mfpu=fpv4-sp-d16
FlightCtr.build.float-abi=-mfloat-abi=hard
FlightCtr.build.flash_offset=0x0
FlightCtr.build.uf2_flash_offset=0x0
FlightCtr.upload.maximum_size=0
FlightCtr.upload.maximum_data_size=0

# Upload menu
FlightCtr.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
FlightCtr.menu.upload_method.swdMethod.upload.protocol=0
FlightCtr.menu.upload_method.swdMethod.upload.options=
FlightCtr.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

