geosmall/Arduino_Core_STM32/boards.txt
FlightCtr.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
FlightCtr.menu.upload_method.serialMethod.upload.protocol=1
FlightCtr.menu.upload_method.serialMethod.upload.options={serial.port.file}
FlightCtr.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

FlightCtr.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
FlightCtr.menu.upload_method.dfuMethod.upload.protocol=2
FlightCtr.menu.upload_method.dfuMethod.upload.options=
FlightCtr.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

FlightCtr.menu.upload_method.jlinkMethod=STM32CubeProgrammer (J-Link)
FlightCtr.menu.upload_method.jlinkMethod.upload.protocol=3
FlightCtr.menu.upload_method.jlinkMethod.upload.options=
FlightCtr.menu.upload_method.jlinkMethod.upload.tool=stm32CubeProg

FlightCtr.menu.upload_method.bootuf2Method=UF2 Bootloader
FlightCtr.menu.upload_method.bootuf2Method.upload.protocol=uf2
FlightCtr.menu.upload_method.bootuf2Method.upload.tool=uf2_upload
FlightCtr.menu.upload_method.bootuf2Method.build.flash_offset={build.uf2_flash_offset}
FlightCtr.menu.upload_method.bootuf2Method.build.bootloader_flags=-DBL_BOOTUF2

FlightCtr.menu.upload_method.clipboard=Clipboard (Copy Path)
FlightCtr.menu.upload_method.clipboard.upload.protocol=0
FlightCtr.menu.upload_method.clipboard.upload.options=-g
FlightCtr.menu.upload_method.clipboard.upload.tool=clipboard_upload

# BlackPill F411CE 8MHz
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ=BlackPill F411CE 8MHz
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.upload.maximum_size=458752
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.upload.maximum_data_size=131072
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.mcu=cortex-m4
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.series=STM32F4xx
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.board=BLACKPILL_F411CE_8MHZ
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.product_line=STM32F411xE
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.variant=STM32F4xx/F411C(C-E)(U-Y)
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.variant_h=variant_BLACKPILL_F411CE_8MHZ.h
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.uf2_family=0x57755a57
FlightCtr.menu.pnum.BLACKPILL_F411CE_8MHZ.build.uf2_flash_offset=0x10000

# OpenPilot Revolution F405
FlightCtr.menu.pnum.OPEN_REVO=OpenPilot Revo F4 (OPEN)
FlightCtr.menu.pnum.OPEN_REVO.upload.maximum_size=983040
FlightCtr.menu.pnum.OPEN_REVO.upload.maximum_data_size=131072
FlightCtr.menu.pnum.OPEN_REVO.build.mcu=cortex-m4
FlightCtr.menu.pnum.OPEN_REVO.build.series=STM32F4xx
FlightCtr.menu.pnum.OPEN_REVO.build.board=OPEN_REVO
FlightCtr.menu.pnum.OPEN_REVO.build.product_line=STM32F405xx
FlightCtr.menu.pnum.OPEN_REVO.build.variant=STM32F4xx/F405RGT_F415RGT
FlightCtr.menu.pnum.OPEN_REVO.build.variant_h=variant_OPEN_REVO.h
FlightCtr.menu.pnum.OPEN_REVO.build.uf2_family=0x57755a57
FlightCtr.menu.pnum.OPEN_REVO.build.uf2_flash_offset=0x10000

# NOXE V3 (JHEF) F411CE flight controller
FlightCtr.menu.pnum.JHEF_JHEF411=NOXE V3 (JHEF)
FlightCtr.menu.pnum.JHEF_JHEF411.upload.maximum_size=458752
FlightCtr.menu.pnum.JHEF_JHEF411.upload.maximum_data_size=131072
FlightCtr.menu.pnum.JHEF_JHEF411.build.mcu=cortex-m4
FlightCtr.menu.pnum.JHEF_JHEF411.build.series=STM32F4xx
FlightCtr.menu.pnum.JHEF_JHEF411.build.board=JHEF_JHEF411
FlightCtr.menu.pnum.JHEF_JHEF411.build.product_line=STM32F411xE
FlightCtr.menu.pnum.JHEF_JHEF411.build.variant=STM32F4xx/F411C(C-E)(U-Y)
FlightCtr.menu.pnum.JHEF_JHEF411.build.variant_h=variant_JHEF_JHEF411.h
FlightCtr.menu.pnum.JHEF_JHEF411.build.uf2_family=0x57755a57
FlightCtr.menu.pnum.JHEF_JHEF411.build.uf2_flash_offset=0x10000
FlightCtr.menu.pnum.JHEF_JHEF411.build.bootloader_bin=bootuf2-noxe_v3-v2.0.0.bin

# NERO F7 (BKMN) F722RET flight controller
FlightCtr.menu.pnum.BKMN_NERO=NERO F7 (BKMN)
FlightCtr.menu.pnum.BKMN_NERO.upload.maximum_size=458752
FlightCtr.menu.pnum.BKMN_NERO.upload.maximum_data_size=262144
FlightCtr.menu.pnum.BKMN_NERO.build.mcu=cortex-m7
FlightCtr.menu.pnum.BKMN_NERO.build.series=STM32F7xx
FlightCtr.menu.pnum.BKMN_NERO.build.board=BKMN_NERO
FlightCtr.menu.pnum.BKMN_NERO.build.product_line=STM32F722xx
FlightCtr.menu.pnum.BKMN_NERO.build.variant=STM32F7xx/F722R(C-E)T_F730R8T_F732RET
FlightCtr.menu.pnum.BKMN_NERO.build.variant_h=variant_BKMN_NERO.h
FlightCtr.menu.pnum.BKMN_NERO.build.uf2_family=0x53b80f00
FlightCtr.menu.pnum.BKMN_NERO.build.uf2_flash_offset=0x10000
FlightCtr.menu.pnum.BKMN_NERO.build.bootloader_bin=bootuf2-nero_f7-v2.0.0.bin

# BetaFPV G473 (BEFH) flight controller
FlightCtr.menu.pnum.BEFH_BETAFPVG473=BetaFPV G473 (BEFH)
FlightCtr.menu.pnum.BEFH_BETAFPVG473.upload.maximum_size=458752
FlightCtr.menu.pnum.BEFH_BETAFPVG473.upload.maximum_data_size=131072
FlightCtr.menu.pnum.BEFH_BETAFPVG473.build.mcu=cortex-m4
FlightCtr.menu.pnum.BEFH_BETAFPVG473.build.series=STM32G4xx
FlightCtr.menu.pnum.BEFH_BETAFPVG473.build.board=BEFH_BETAFPVG473
FlightCtr.menu.pnum.BEFH_BETAFPVG473.build.product_line=STM32G473xx
FlightCtr.menu.pnum.BEFH_BETAFPVG473.build.variant=STM32G4xx/G473C(B-C-E)U_G474C(B-C-E)U_G483CEU_G484CEU
FlightCtr.menu.pnum.BEFH_BETAFPVG473.build.variant_h=variant_BEFH_BETAFPVG473.h
FlightCtr.menu.pnum.BEFH_BETAFPVG473.build.uf2_family=0x4c71240a
FlightCtr.menu.pnum.BEFH_BETAFPVG473.build.uf2_flash_offset=0x10000
FlightCtr.menu.pnum.BEFH_BETAFPVG473.build.bootloader_bin=bootuf2-betafpv_g473-v2.0.0.bin

# DevEBox H743VITx
FlightCtr.menu.pnum.DEVEBOX_H743=DevEBox H743VITx
FlightCtr.menu.pnum.DEVEBOX_H743.upload.maximum_size=1966080
FlightCtr.menu.pnum.DEVEBOX_H743.upload.maximum_data_size=524288
FlightCtr.menu.pnum.DEVEBOX_H743.build.mcu=cortex-m7
FlightCtr.menu.pnum.DEVEBOX_H743.build.series=STM32H7xx
FlightCtr.menu.pnum.DEVEBOX_H743.build.board=DEVEBOX_H743
FlightCtr.menu.pnum.DEVEBOX_H743.build.product_line=STM32H743xx
FlightCtr.menu.pnum.DEVEBOX_H743.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
FlightCtr.menu.pnum.DEVEBOX_H743.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
FlightCtr.menu.pnum.DEVEBOX_H743.build.variant_h=variant_DEVEBOX_H743.h
FlightCtr.menu.pnum.DEVEBOX_H743.build.uf2_family=0x6db66082
FlightCtr.menu.pnum.DEVEBOX_H743.build.uf2_flash_offset=0x20000

# Matek H743-WLITE
FlightCtr.menu.pnum.MATEK_H743VI=Matek H743VITx
FlightCtr.menu.pnum.MATEK_H743VI.upload.maximum_size=1966080
FlightCtr.menu.pnum.MATEK_H743VI.upload.maximum_data_size=524288
FlightCtr.menu.pnum.MATEK_H743VI.build.mcu=cortex-m7
FlightCtr.menu.pnum.MATEK_H743VI.build.series=STM32H7xx
FlightCtr.menu.pnum.MATEK_H743VI.build.board=MATEK_H743VI
FlightCtr.menu.pnum.MATEK_H743VI.build.product_line=STM32H743xx
FlightCtr.menu.pnum.MATEK_H743VI.build.st_extra_flags=-DCORE_CM7 -D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
FlightCtr.menu.pnum.MATEK_H743VI.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)
FlightCtr.menu.pnum.MATEK_H743VI.build.variant_h=variant_MATEK_H743VI.h
FlightCtr.menu.pnum.MATEK_H743VI.build.uf2_family=0x6db66082
FlightCtr.menu.pnum.MATEK_H743VI.build.uf2_flash_offset=0x20000
FlightCtr.menu.pnum.MATEK_H743VI.build.bootloader_bin=bootuf2-matek_h743-v2.0.0.bin

################################################################################
# Serialx activation
Nucleo_144.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_144.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_144.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_144.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_144.menu.xserial.disabled.build.xSerial=

