geosmall/Arduino_Core_STM32/boards.txt
GenH7.menu.usb.none=None
GenH7.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
GenH7.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
GenH7.menu.usb.CDC=CDC (no generic 'Serial')
GenH7.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
GenH7.menu.usb.HID=HID (keyboard and mouse)
GenH7.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
GenH7.menu.xusb.FS=Low/Full Speed
GenH7.menu.xusb.HS=High Speed
GenH7.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
GenH7.menu.xusb.HSFS=High Speed in Full Speed mode
GenH7.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

FlightCtr.menu.usb.none=None
FlightCtr.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
FlightCtr.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
FlightCtr.menu.usb.CDC=CDC (no generic 'Serial')
FlightCtr.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
FlightCtr.menu.usb.HID=HID (keyboard and mouse)
FlightCtr.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
FlightCtr.menu.xusb.FS=Low/Full Speed
FlightCtr.menu.xusb.HS=High Speed
FlightCtr.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
FlightCtr.menu.xusb.HSFS=High Speed in Full Speed mode
FlightCtr.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

# Optimizations
Nucleo_144.menu.opt.osstd=Smallest (-Os default)
Nucleo_144.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_144.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_144.menu.opt.o1std=Fast (-O1)
Nucleo_144.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_144.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_144.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_144.menu.opt.o2std=Faster (-O2)
Nucleo_144.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_144.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_144.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_144.menu.opt.o3std=Fastest (-O3)
Nucleo_144.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_144.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_144.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_144.menu.opt.ogstd=Debug (-Og)
Nucleo_144.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_144.menu.opt.o0std=No Optimization (-O0)
Nucleo_144.menu.opt.o0std.build.flags.optimize=-O0

Nucleo_64.menu.opt.osstd=Smallest (-Os default)
Nucleo_64.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_64.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_64.menu.opt.o1std=Fast (-O1)
Nucleo_64.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_64.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_64.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_64.menu.opt.o2std=Faster (-O2)
Nucleo_64.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_64.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_64.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_64.menu.opt.o3std=Fastest (-O3)
Nucleo_64.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_64.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_64.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_64.menu.opt.ogstd=Debug (-Og)
Nucleo_64.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_64.menu.opt.o0std=No Optimization (-O0)
Nucleo_64.menu.opt.o0std.build.flags.optimize=-O0

Nucleo_32.menu.opt.osstd=Smallest (-Os default)
Nucleo_32.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_32.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_32.menu.opt.o1std=Fast (-O1)
Nucleo_32.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_32.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_32.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_32.menu.opt.o2std=Faster (-O2)
Nucleo_32.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_32.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_32.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_32.menu.opt.o3std=Fastest (-O3)
Nucleo_32.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_32.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_32.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_32.menu.opt.ogstd=Debug (-Og)
Nucleo_32.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_32.menu.opt.o0std=No Optimization (-O0)
Nucleo_32.menu.opt.o0std.build.flags.optimize=-O0

GenF4.menu.opt.osstd=Smallest (-Os default)
GenF4.menu.opt.oslto=Smallest (-Os) with LTO
GenF4.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF4.menu.opt.o1std=Fast (-O1)
GenF4.menu.opt.o1std.build.flags.optimize=-O1
GenF4.menu.opt.o1lto=Fast (-O1) with LTO
GenF4.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF4.menu.opt.o2std=Faster (-O2)
GenF4.menu.opt.o2std.build.flags.optimize=-O2
GenF4.menu.opt.o2lto=Faster (-O2) with LTO
GenF4.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF4.menu.opt.o3std=Fastest (-O3)
GenF4.menu.opt.o3std.build.flags.optimize=-O3
GenF4.menu.opt.o3lto=Fastest (-O3) with LTO
GenF4.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF4.menu.opt.ogstd=Debug (-Og)
GenF4.menu.opt.ogstd.build.flags.optimize=-Og
GenF4.menu.opt.o0std=No Optimization (-O0)
GenF4.menu.opt.o0std.build.flags.optimize=-O0

GenF7.menu.opt.osstd=Smallest (-Os default)
GenF7.menu.opt.oslto=Smallest (-Os) with LTO
GenF7.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF7.menu.opt.o1std=Fast (-O1)
GenF7.menu.opt.o1std.build.flags.optimize=-O1
GenF7.menu.opt.o1lto=Fast (-O1) with LTO
GenF7.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF7.menu.opt.o2std=Faster (-O2)
GenF7.menu.opt.o2std.build.flags.optimize=-O2
GenF7.menu.opt.o2lto=Faster (-O2) with LTO
GenF7.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF7.menu.opt.o3std=Fastest (-O3)
GenF7.menu.opt.o3std.build.flags.optimize=-O3
GenF7.menu.opt.o3lto=Fastest (-O3) with LTO
GenF7.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF7.menu.opt.ogstd=Debug (-Og)
GenF7.menu.opt.ogstd.build.flags.optimize=-Og
GenF7.menu.opt.o0std=No Optimization (-O0)
GenF7.menu.opt.o0std.build.flags.optimize=-O0

GenG4.menu.opt.osstd=Smallest (-Os default)
GenG4.menu.opt.oslto=Smallest (-Os) with LTO
GenG4.menu.opt.oslto.build.flags.optimize=-Os -flto
GenG4.menu.opt.o1std=Fast (-O1)
GenG4.menu.opt.o1std.build.flags.optimize=-O1
GenG4.menu.opt.o1lto=Fast (-O1) with LTO
GenG4.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenG4.menu.opt.o2std=Faster (-O2)
GenG4.menu.opt.o2std.build.flags.optimize=-O2
GenG4.menu.opt.o2lto=Faster (-O2) with LTO
GenG4.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenG4.menu.opt.o3std=Fastest (-O3)
GenG4.menu.opt.o3std.build.flags.optimize=-O3
GenG4.menu.opt.o3lto=Fastest (-O3) with LTO
GenG4.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenG4.menu.opt.ogstd=Debug (-Og)
GenG4.menu.opt.ogstd.build.flags.optimize=-Og
GenG4.menu.opt.o0std=No Optimization (-O0)
GenG4.menu.opt.o0std.build.flags.optimize=-O0

GenH7.menu.opt.osstd=Smallest (-Os default)
GenH7.menu.opt.oslto=Smallest (-Os) with LTO
GenH7.menu.opt.oslto.build.flags.optimize=-Os -flto
GenH7.menu.opt.o1std=Fast (-O1)
GenH7.menu.opt.o1std.build.flags.optimize=-O1
GenH7.menu.opt.o1lto=Fast (-O1) with LTO
GenH7.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenH7.menu.opt.o2std=Faster (-O2)
GenH7.menu.opt.o2std.build.flags.optimize=-O2
GenH7.menu.opt.o2lto=Faster (-O2) with LTO
GenH7.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenH7.menu.opt.o3std=Fastest (-O3)
GenH7.menu.opt.o3std.build.flags.optimize=-O3
GenH7.menu.opt.o3lto=Fastest (-O3) with LTO
GenH7.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenH7.menu.opt.ogstd=Debug (-Og)
GenH7.menu.opt.ogstd.build.flags.optimize=-Og
GenH7.menu.opt.o0std=No Optimization (-O0)
GenH7.menu.opt.o0std.build.flags.optimize=-O0

FlightCtr.menu.opt.osstd=Smallest (-Os default)
FlightCtr.menu.opt.oslto=Smallest (-Os) with LTO
FlightCtr.menu.opt.oslto.build.flags.optimize=-Os -flto
FlightCtr.menu.opt.o1std=Fast (-O1)
FlightCtr.menu.opt.o1std.build.flags.optimize=-O1
FlightCtr.menu.opt.o1lto=Fast (-O1) with LTO
FlightCtr.menu.opt.o1lto.build.flags.optimize=-O1 -flto
FlightCtr.menu.opt.o2std=Faster (-O2)
FlightCtr.menu.opt.o2std.build.flags.optimize=-O2
FlightCtr.menu.opt.o2lto=Faster (-O2) with LTO
FlightCtr.menu.opt.o2lto.build.flags.optimize=-O2 -flto
FlightCtr.menu.opt.o3std=Fastest (-O3)
FlightCtr.menu.opt.o3std.build.flags.optimize=-O3
FlightCtr.menu.opt.o3lto=Fastest (-O3) with LTO
FlightCtr.menu.opt.o3lto.build.flags.optimize=-O3 -flto
FlightCtr.menu.opt.ogstd=Debug (-Og)
FlightCtr.menu.opt.ogstd.build.flags.optimize=-Og
FlightCtr.menu.opt.o0std=No Optimization (-O0)
FlightCtr.menu.opt.o0std.build.flags.optimize=-O0

# Debug information
Nucleo_144.menu.dbg.none=None
Nucleo_144.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_144.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_144.menu.dbg.enable_log=Core logs Enabled
Nucleo_144.menu.dbg.enable_log.build.flags.debug=
Nucleo_144.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_144.menu.dbg.enable_all.build.flags.debug=-g

Nucleo_64.menu.dbg.none=None
Nucleo_64.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_64.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_64.menu.dbg.enable_log=Core logs Enabled
Nucleo_64.menu.dbg.enable_log.build.flags.debug=
Nucleo_64.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_64.menu.dbg.enable_all.build.flags.debug=-g

Nucleo_32.menu.dbg.none=None
Nucleo_32.menu.dbg.enable_sym=Symbols Enabled (-g)
Nucleo_32.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Nucleo_32.menu.dbg.enable_log=Core logs Enabled
Nucleo_32.menu.dbg.enable_log.build.flags.debug=
Nucleo_32.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Nucleo_32.menu.dbg.enable_all.build.flags.debug=-g

