geosmall/Arduino_Core_STM32/boards.txt
GenF4.menu.dbg.none=None
GenF4.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF4.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF4.menu.dbg.enable_log=Core logs Enabled
GenF4.menu.dbg.enable_log.build.flags.debug=
GenF4.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF4.menu.dbg.enable_all.build.flags.debug=-g

GenF7.menu.dbg.none=None
GenF7.menu.dbg.enable_sym=Symbols Enabled (-g)
GenF7.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenF7.menu.dbg.enable_log=Core logs Enabled
GenF7.menu.dbg.enable_log.build.flags.debug=
GenF7.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenF7.menu.dbg.enable_all.build.flags.debug=-g

GenG4.menu.dbg.none=None
GenG4.menu.dbg.enable_sym=Symbols Enabled (-g)
GenG4.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenG4.menu.dbg.enable_log=Core logs Enabled
GenG4.menu.dbg.enable_log.build.flags.debug=
GenG4.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenG4.menu.dbg.enable_all.build.flags.debug=-g

GenH7.menu.dbg.none=None
GenH7.menu.dbg.enable_sym=Symbols Enabled (-g)
GenH7.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
GenH7.menu.dbg.enable_log=Core logs Enabled
GenH7.menu.dbg.enable_log.build.flags.debug=
GenH7.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
GenH7.menu.dbg.enable_all.build.flags.debug=-g

FlightCtr.menu.dbg.none=None
FlightCtr.menu.dbg.enable_sym=Symbols Enabled (-g)
FlightCtr.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
FlightCtr.menu.dbg.enable_log=Core logs Enabled
FlightCtr.menu.dbg.enable_log.build.flags.debug=
FlightCtr.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
FlightCtr.menu.dbg.enable_all.build.flags.debug=-g

# C Runtime Library
Nucleo_144.menu.rtlib.nano=Newlib Nano (default)
Nucleo_144.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_144.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_144.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_144.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_144.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_144.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_144.menu.rtlib.full=Newlib Standard
Nucleo_144.menu.rtlib.full.build.flags.ldspecs=

Nucleo_64.menu.rtlib.nano=Newlib Nano (default)
Nucleo_64.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_64.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_64.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_64.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_64.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_64.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_64.menu.rtlib.full=Newlib Standard
Nucleo_64.menu.rtlib.full.build.flags.ldspecs=

Nucleo_32.menu.rtlib.nano=Newlib Nano (default)
Nucleo_32.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_32.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_32.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_32.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_32.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_32.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_32.menu.rtlib.full=Newlib Standard
Nucleo_32.menu.rtlib.full.build.flags.ldspecs=

GenF4.menu.rtlib.nano=Newlib Nano (default)
GenF4.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF4.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF4.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF4.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF4.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF4.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF4.menu.rtlib.full=Newlib Standard
GenF4.menu.rtlib.full.build.flags.ldspecs=

GenF7.menu.rtlib.nano=Newlib Nano (default)
GenF7.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF7.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF7.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF7.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF7.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF7.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF7.menu.rtlib.full=Newlib Standard
GenF7.menu.rtlib.full.build.flags.ldspecs=

GenG4.menu.rtlib.nano=Newlib Nano (default)
GenG4.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenG4.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenG4.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenG4.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenG4.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenG4.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenG4.menu.rtlib.full=Newlib Standard
GenG4.menu.rtlib.full.build.flags.ldspecs=

GenH7.menu.rtlib.nano=Newlib Nano (default)
GenH7.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenH7.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenH7.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenH7.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenH7.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenH7.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenH7.menu.rtlib.full=Newlib Standard
GenH7.menu.rtlib.full.build.flags.ldspecs=

FlightCtr.menu.rtlib.nano=Newlib Nano (default)
FlightCtr.menu.rtlib.nanofp=Newlib Nano + Float Printf
FlightCtr.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
FlightCtr.menu.rtlib.nanofs=Newlib Nano + Float Scanf
FlightCtr.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
FlightCtr.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
FlightCtr.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
FlightCtr.menu.rtlib.full=Newlib Standard
FlightCtr.menu.rtlib.full.build.flags.ldspecs=
